/*  Напиши скрипт покупки в магазине 
Баланс зранится в переменной balance
Сума покупки хранится в переменной payment

Перед 
 */
// let balance = 10000;
// const payment = 2000;



/*Створимо функцію, яка обробляє зняття коштів з особистого рахунку в банку. 
Вона отримує суму для зняття і поточний баланс рахунку, після чого, залежно від умови, виконує необхідний блок коду.
*/

// function withdraw(amount, balance) {
//     if (amount === 0) {
//       console.log("Для проведення операції введіть суму більшу за нуль");
//     } else if (amount > balance) {
//       console.log("Недостатньо коштів на рахунку");
//     } else {
//       console.log("Операція зняття коштів проведена успішно");
//     }
//   }
  
//   withdraw(0, 300); // "Для проведення операції введіть суму більшу за нуль"
//   withdraw(500, 300); // "Недостатньо коштів на рахунку"
//   withdraw(100, 300);